tutorials/multiCompression/RiemannTube/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DT              DT [0 2 -1 0 0 0 0] 0.01; // m^2/s

MU              MU [1 -1 -1 0 0 0 0] 18.1e06; // [kg/m/s = Pa·s], T = 20C˚
                                              // dinamic viscosity for air

DIFFDENSITY		DIFFDENSITY [1 -3 0 0 0 0 0] 1;

GAMMA           GAMMA [0 0 0 0 0 0 0] 1.4; // heat capacity ratio

LAMBDA          LAMBDA [1 1 -3 -1 0 0 0] 0.02; // [kg·m/s³/K = W/m/K]
                                               // coefficient of thermal
                                               // conductivity

// ************************************************************************* //
