tutorials/multiCompression/RiemannTube/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions			[1 -1 -2 0 0 0 0]; // [kg/m/s^2 = Pa]

internalField		nonuniform List<scalar> 
40
(
	10e04
	10e04
	10e04
	10e04
	10e04
	10e04
	10e04
	10e04
...
)
;


boundaryField
{
	walls
	{
		type		zeroGradient;
	}
}

// ************************************************************************* //
