tutorials/multiCompression/RiemannTube/0/rho.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: Addition to OpenFOAM v6
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.2-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions			[1 -3 0 0 0 0 0]; // kg/m^3

internalField		nonuniform List<scalar> 
40
(
1.204
1.204
1.204
1.204
1.204
1.204
1.204
1.204
...
)
;

boundaryField
{
	walls
	{
		type		zeroGradient;
	}
}


// ************************************************************************* //
